# 2. URL 과 리소스

- URL(Uniform Resource Locator) : 인터넷의 리소스를  가리키는 표준 이름
    - 전자정보 일부를 가리키고 그것이 어디에 있고 어떻게 접근할 수 있는지
- 이 장의 내용
    - URL 문법
        - 각 컴포넌트가 어떤 의미를 가지며 무엇을 수행하는지
    - 상대 URL 과 절대 URL
    - URL 인코딩과 문자 규칙
    - 공통 URL 스킴
    - URL의 미래(URN 등)

---

## 1. 인터넷의 리소스 탐색하기

- 사용자와 애플리케이션은 URL 을 이용해 인터넷 상의 수십억 개의 리소스를 찾고 사용하며 공유할 수 있음
    - 사용자는 브라우저에 URL을 입력하고
    - 브라우저는 화면 뒤에서 사용자가 원하는 리소스를 얻기 위해서 적절한 프로토콜을 사용하여 메시지를 전송함
- URL은 URI(Uniform Resourcee Identifier)의 부분집합이나 이 책에서는 대부분 URL을 사용함
- URL 주요 구성
    - `스킴://서버위치/경로`
    - 스킴: 웹 클라이언트가 리소스에 어떻게 접근하는지
        - http: hyper text transfer protocol
        - ftp: file transfer protocol
        - rtsp: real time streaming protocol
        - mailto: 이메일 주소
    - 서버의 위치: 리소스가 어디에 호스팅되어 있는지
    - 리소스의 경로: 서버에 존재하는 로컬 리소스들 중에서 요청받은 리소스가 무엇인지
- URL은 인터넷에 있는 어떤 리소스든지 가리킬 수 있음

## 2. URL 문법

- 그러나 서로 다른 URL 스킴은 다르지만 유사한 URL문법을 가짐

### 스킴

- 리소스를 가져오려면 어떤 프로토콜을 사용하여 서버에 접근해야 하는지
- 알파벳으로 시작해야 함
- URL 나머지 부분과 첫번째 `:` 로 구분
- 대소문자를 가리지 않음

### 사용자이름과 비밀번호

- FTP 서버의 예시
- `@` 문자로 URL 의 다른 부분과 구분

### 호스트와 포트

- 리소스를 호스팅하고 있는 장비
- 그 장비 내에서 리소스에 접근할 수 있는 서버가 어디에 있는지
    - TCP 프로토콜을 사용하는 HTTP는 기본 포트로 80번 사용

### 경로

- 리소스가 서버 어디에 있는지
- 계층적 파일 시스템 경로와 유사한 구조
- `/` 문자로 구분된 각 경로조각은 자체만의 파라미터 컴포넌트를 가질 수 있음
    
    `http://www.joes-hardware.com/hammers;**sale=false**/index.html;**graphics=true**`
    
    - `hammers` 경로조각은 `sale=false` 파라미터를 가짐
    - `index.html` 경로조각은 `graphics=false` 파라미터를 가짐

### 파라미터

- `;` 문자로 구분
- 이름/값 쌍

### 질의

- 쿼리 스트링
- `?` 로 URL의 다른 부분과 구분
- `&` 로 여러 개의 질의 가능
- 웹 데이터베이스 게이트웨이에 질의하는 데 사용됨
    
    `http://www.joes-hardware.com/inventory-check.cgi?**item=12731**`
    

### 프래그먼트

- 리소스 내의 조각을 가리킴
- 클라이언트는 서버에  프래그먼트를 전달하지 않음
    - 브라우저가 서버로부터 전체 리소스를 내려받은 후, 프래그먼트를 사용하여 당신이 보고자 하는 리소스의 일부를 보여줌

## 3. 단축 URL

### 상대 URL

- 리소스 안에 있는 리소스를 간결하게 기술하는 데 사용
- 기저  URL 을 사용해야 함
- 프래그먼트이거나 URL 일부
- 브라우저는 상대 URL 과 절대 URL 간 상호변환을 할 수 있어야 함
- 리소스 집합을 쉽게 변경할 수 있음
    - 문서 집합의 위치를 변경하더라도 새로운 기저 URL 에 의해서 해석될 것이므로
- 브라우저가 기저 URL을 찾는 방법
    - 리소스에서 명시적으로 제공
        - HTML 문서의 `<Base>` 태그 사용
    - 리소스를 포함하고 있는 URL
        - 해당 리소스의 URL을 기저 URL로 사용
    - 기저 URL 이 없는 경우
        - 절대 URL 만으로 이루어져 있거나 깨진 URL

### URL 확장

- 많은 브라우저는 URL 일부를 입력하면 나머지 부분을 자동으로 입력해줌
- `yahoo` 를 입력하면 `www`와 `.com`을 붙여줌
- 프락시와 같은 다른 HTTP 애플리케이션에 문제를 발생시킬 수도 있음(6장)
- 사용자가 URL을 입력하는  시간을 줄이고자 브라우저가 사용하는 다른 기술
    - URL 히스토리 저장

## 4. URL에 사용하기에 안전하지 않은 문자 처리

- 이스케이프 기능
    - 사용자들이 URL에 안전한 문자(이진데이터나 알파벳) 외의 문자도 포함하려고 하면
    - 안전한 문자로 인코딩함
- 인코딩 규칙
    - `%` 문자로 시작해 ASCII 코드로 표현되는 두개의 16진수 숫자로 이루어진 이스케이프 문자로 변환
    - 문자 제한(예약된 문자)
        - % / . .. # ? ; : $, + @ & = { } | \ ~ [ ] ` < > “ 0x00~0x1F, 0x7F >

## 5. 스킴

- http
    - 80번 포트
- https
    - http 커넥션 양 끝단에서 보안 소켓 계층(Secure Socket Layer) 사용
    - 443번 포트
- mailto
    - 이메일 주소
    - 다른 스킴과는 다르게 동작함
- ftp
    - 파일 전송
- rtsp, rtspu
    - 실시간 스트리밍 프로토콜
    - rtspu 는 전송계층 UDP 사용
- file
    - 호스트 기기에서 바로 접근할 수 있는 파일
- news
    - 특정 문서나 뉴스 그룹에 접근하는 데 사용
- telnet
    - 대화형 서비스에 접근하는데 사용

## 6. URL 의 미래

- URL의 한계
    - 리소스의 주소이지 실제 이름이 아님
    - 리소스가 옮겨지면 더는 사용할 수 없음
- URN(Uniform Resource Names)
    - 그 객체의 위치와 상관없이 그 객체를 가리키는 실제 객체의 이름을 사용
    - 위치가 바뀌더라도 리소스를 찾을 수 있음
- PURL(Persistent URL)
    - URL로 URN 기능 제공
    - 실제 URL 목록을 관리하고 추적하는 리소스 위치 중개 서버를 두고 해당 리소스를 우회적으로 제공
    - 클라이언트는 위치 할당자에게 리소스를 가져올 수 있는 영구적인 URL을 요청함
    - 영구적인 URL 은 클라이언트를 리소스의 실제 URL로 연결해줌
